logs/benchmark_20250706_231618/h3_50ms_0pct.log
=== HTTP/3 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-06 23:16:38
Delay: 50ms
Loss: 0%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 80ac: root refcnt 9 limit 1000 delay 50ms

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 50 total requests
spawning thread #1: 5 total client(s). 50 total requests
spawning thread #2: 5 total client(s). 50 total requests
spawning thread #3: 5 total client(s). 50 total requests
spawning thread #4: 5 total client(s). 50 total requests
spawning thread #5: 5 total client(s). 50 total requests
spawning thread #6: 5 total client(s). 50 total requests
spawning thread #7: 5 total client(s). 50 total requests
spawning thread #8: 5 total client(s). 50 total requests
spawning thread #9: 5 total client(s). 50 total requests
spawning thread #10: 5 total client(s). 50 total requests
spawning thread #11: 5 total client(s). 50 total requests
spawning thread #12: 5 total client(s). 50 total requests
spawning thread #13: 5 total client(s). 50 total requests
spawning thread #14: 5 total client(s). 50 total requests
spawning thread #15: 5 total client(s). 50 total requests
spawning thread #16: 5 total client(s). 50 total requests
spawning thread #17: 5 total client(s). 50 total requests
spawning thread #18: 5 total client(s). 50 total requests
spawning thread #19: 5 total client(s). 50 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 1.05s, 954.43 req/s, 266.80KB/s
requests: 1000 total, 1000 started, 1000 done, 1000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 279.53KB (286243) total, 211.85KB (216935) headers (space savings 26.46%), 60.55KB (62000) data
UDP datagram: 766 sent, 683 received
                     min         max         mean         sd        +/- sd
time for request:      920us    323.03ms     84.03ms    103.81ms    69.70%
time for connect:    60.12ms       1.04s    118.89ms    210.35ms    95.00%
time to 1st byte:    67.32ms       1.04s    171.38ms    215.14ms    95.00%
req/s           :       9.55      140.46       73.33       45.57    74.00%
Waiting 2s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 450 total requests
spawning thread #1: 5 total client(s). 450 total requests
spawning thread #2: 5 total client(s). 450 total requests
spawning thread #3: 5 total client(s). 450 total requests
spawning thread #4: 5 total client(s). 450 total requests
spawning thread #5: 5 total client(s). 450 total requests
spawning thread #6: 5 total client(s). 450 total requests
spawning thread #7: 5 total client(s). 450 total requests
spawning thread #8: 5 total client(s). 450 total requests
spawning thread #9: 5 total client(s). 450 total requests
spawning thread #10: 5 total client(s). 450 total requests
spawning thread #11: 5 total client(s). 450 total requests
spawning thread #12: 5 total client(s). 450 total requests
spawning thread #13: 5 total client(s). 450 total requests
spawning thread #14: 5 total client(s). 450 total requests
spawning thread #15: 5 total client(s). 450 total requests
spawning thread #16: 5 total client(s). 450 total requests
spawning thread #17: 5 total client(s). 450 total requests
spawning thread #18: 5 total client(s). 450 total requests
spawning thread #19: 5 total client(s). 450 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done

finished in 1.08s, 6738.39 req/s, 1.85MB/s
requests: 9000 total, 9000 started, 7290 done, 7290 succeeded, 1710 failed, 1710 errored, 0 timeout
status codes: 7290 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 2.00MB (2093711) total, 1.50MB (1574177) headers (space savings 26.80%), 441.39KB (451980) data
UDP datagram: 1605 sent, 2472 received
                     min         max         mean         sd        +/- sd
time for request:     1.02ms    483.57ms    231.49ms    145.50ms    55.36%
time for connect:    71.36ms       1.03s    143.26ms    242.63ms    93.00%
time to 1st byte:    82.90ms       1.03s    176.31ms    262.92ms    91.36%
req/s           :       0.00      360.86      163.04       93.75    73.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/3 (confirmed)
Fair Comparison: Enabled
Warmup Requests: 1000
Measurement Requests: 9000
End Time: 2025-07-06 23:16:42
CSV Log: /logs/benchmark_20250706_231618/h3_50ms_0pct.csv